app/controllers/comments_controller.rb

    def create
        comment = Comment.create!(comment_params)
---
INSERT INTO "comments" ("trip_id", "user_id", "comment", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["trip_id", 2], ["user_id", 2], ["comment", "yes!"], ["date", "2022-12-15 11:30:00"], ["created_at", "2022-12-22 06:12:47.361835"], ["updated_at", "2022-12-22 06:12:47.361835"]]