app/controllers/mountain_trips_controller.rb

INSERT INTO "mountain_trips" ("trip_id", "mountain_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["trip_id", 2], ["mountain_id", 2], ["created_at", "2022-12-22 04:00:11.325654"], ["updated_at", "2022-12-22 04:00:11.325654"]]
INSERT INTO "trips" ("user_id", "trip_start", "trip_end", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["trip_start", "2022-12-16 11:30:00"], ["trip_end", "2022-12-20 11:30:00"], ["created_at", "2022-12-22 03:56:36.552312"], ["updated_at", "2022-12-22 03:56:36.552312"]]
---
    def create
        mtn_trip = MountainTrip.create!(mtn_trip_params)

SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_mountain_trip
        @mountain_trip = MountainTrip.find(params[:id])