app/controllers/trips_controller.rb

    def index
        render json: Trip.all, status: :ok
---
SELECT "trips".* FROM "trips"

    def create
        trip = Trip.create!(trip_params)
        UserTrip.create!(user_id: params[:user_id], trip_id: trip.id)
---
INSERT INTO "trips" ("user_id", "trip_start", "trip_end", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["trip_start", "2022-12-16 11:30:00"], ["trip_end", "2022-12-20 11:30:00"], ["created_at", "2022-12-20 23:24:22.474364"], ["updated_at", "2022-12-20 23:24:22.474364"]]
INSERT INTO "trips" ("user_id", "trip_start", "trip_end", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["trip_start", "2022-12-16 11:30:00"], ["trip_end", "2022-12-20 11:30:00"], ["created_at", "2022-12-21 18:38:09.347108"], ["updated_at", "2022-12-21 18:38:09.347108"]]