app/controllers/user_trips_controller.rb

INSERT INTO "user_trips" ("trip_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["trip_id", 2], ["user_id", 2], ["created_at", "2022-12-21 20:49:30.660217"], ["updated_at", "2022-12-21 20:49:30.660217"]]
---
    def create
        usertrip = UserTrip.create!(usertrip_params)

SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_user_trip
        @user_trip = UserTrip.find(params[:id])